       IDENTIFICATION DIVISION.
       PROGRAM-ID. WriteAndEdit.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OUTPUT-FILE ASSIGN TO ASW
               ORGANIZATION IS LINE SEQUENTIAL.
       
       DATA DIVISION.
       FILE SECTION.
       FD  OUTPUT-FILE.                                                 
       01  OUTPUT-RECORD PIC X(80).
       
       WORKING-STORAGE SECTION.
       01  PHRASE       PIC X(80) VALUE SPACES.
       01  ASW          PIC X(20) VALUE SPACES.
       01  ASW2         PIC X(4) VALUE SPACES.
       01  TETELEC      PIC X VALUE 'N'.
       01  SHELL-COMMAND PIC X(50) VALUE 'ls'.
       
       PROCEDURE DIVISION.
           PERFORM ASKUSER
           STOP RUN.
       
       WRITE-FILE.
           OPEN OUTPUT OUTPUT-FILE
           DISPLAY "Set data to put in the file."
           ACCEPT PHRASE
           MOVE PHRASE TO OUTPUT-RECORD
           WRITE OUTPUT-RECORD
           CLOSE OUTPUT-FILE
           DISPLAY "Data written to file."
           PERFORM ASKUSER.
       
       READ-FILE.
           DISPLAY " "
           OPEN INPUT OUTPUT-FILE
           MOVE 'N' TO TETELEC
           PERFORM UNTIL TETELEC = 'Y'
               READ OUTPUT-FILE INTO OUTPUT-RECORD
                   AT END
                       MOVE 'Y' TO TETELEC
                   NOT AT END
                       DISPLAY OUTPUT-RECORD
               END-PERFORM.
           CLOSE OUTPUT-FILE
           
           PERFORM ASKUSER.
              
       
       LISTING.
           DISPLAY " "
           DISPLAY 'List of .dat files:'
           DISPLAY " "
           CALL 'SYSTEM' USING SHELL-COMMAND
           
           PERFORM ASKUSER.
       
       CREATEDIT.
           DISPLAY "Enter file name to Create/Modify :"
           ACCEPT ASW
           PERFORM ASKUSER.
       
       ASKUSER.
           DISPLAY " "
           DISPLAY " "
           DISPLAY "Select an option for the file:"
           DISPLAY " "
           DISPLAY " CRED - Create/Modify a file"
           DISPLAY " WRIT - Write to file selected"
           DISPLAY " READ - Read from file selected"
           DISPLAY " LIST - List .dat files"
           DISPLAY " EXIT - To Exit Program"
           DISPLAY " HELP - To get basic additional infos"
           ACCEPT ASW2
       
           EVALUATE ASW2
               WHEN 'WRIT'
                   PERFORM WRITE-FILE
               WHEN 'READ'
                   PERFORM READ-FILE
               WHEN 'LIST'
                   PERFORM LISTING
               WHEN 'EXIT'
                   DISPLAY "Exiting program."
               WHEN 'CRED'
                    PERFORM CREATEDIT
               WHEN 'HELP'
                    PERFORM HELP
               WHEN OTHER
                   DISPLAY "Invalid option. Please try again."
                   PERFORM ASKUSER
           END-EVALUATE.
       



       HELP.
           DISPLAY " ".
           DISPLAY " ".
           DISPLAY " ".
           DISPLAY " This is the HELP Section"
           DISPLAY " ".
           DISPLAY "1. If you attempt to Modify or Read a file without".
           DISPLAY "creating or select it, the program will display an".
           DISPLAY "error and close".
           DISPLAY " ".
           DISPLAY "2. LIST command will display every file present in".
           DISPLAY "the directory, whatever its extention".
           DISPLAY " ".
           PERFORM ASKUSER.
