       IDENTIFICATION DIVISION.
       PROGRAM-ID. WriteAndEdit.
       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OUTPUT-FILE ASSIGN TO NOWFILE
               ORGANIZATION IS LINE SEQUENTIAL.
       
       DATA DIVISION.
       FILE SECTION.
       FD  OUTPUT-FILE.                                                 
       01  OUTPUT-RECORD PIC X(80).
       
       WORKING-STORAGE SECTION.
       01 STUFF.
           05  PHRASE        PIC X(80) VALUE SPACES.
           05  ASW           PIC X(4) VALUE SPACES.
           05  TETELEC       PIC X VALUE 'N'.
           05  SHELL-COMMAND PIC X(3) VALUE 'ls'.
           05 DELSTART       PIC X(3) VALUE 'rm '.
           05 NOWFILE        PIC X(20) VALUE SPACES.
       66  DELCMD RENAMES DELSTART THRU NOWFILE.
       
       PROCEDURE DIVISION.
           PERFORM ASKUSER
           STOP RUN.
       
       WRITE-FILE.
           OPEN OUTPUT OUTPUT-FILE
           DISPLAY "Set data to put in the file."
           ACCEPT PHRASE
           MOVE PHRASE TO OUTPUT-RECORD
           WRITE OUTPUT-RECORD
           CLOSE OUTPUT-FILE
           DISPLAY "Data written to file."
           PERFORM ASKUSER.
       
       READ-FILE.
           DISPLAY " "
           OPEN INPUT OUTPUT-FILE
           MOVE 'N' TO TETELEC
           PERFORM UNTIL TETELEC = 'Y'
               READ OUTPUT-FILE INTO OUTPUT-RECORD
                   AT END
                       MOVE 'Y' TO TETELEC
                   NOT AT END
                       DISPLAY OUTPUT-RECORD
               END-PERFORM.
           CLOSE OUTPUT-FILE
           
           PERFORM ASKUSER.
     

       LISTING.
           DISPLAY " "
           DISPLAY 'List of .dat files:'
           DISPLAY " "
           CALL 'SYSTEM' USING SHELL-COMMAND.
           
           PERFORM ASKUSER.
       
       CREATEDIT.
           DISPLAY "Enter file name to Create/Modify :"
           ACCEPT NOWFILE
           PERFORM ASKUSER.
       
       ASKUSER.
           DISPLAY " "
           DISPLAY " "
           DISPLAY "Select an option for : "NOWFILE
           DISPLAY " "
           DISPLAY " CRED - Create/Modify a file"
           DISPLAY " WRIT - Write to file selected"
           DISPLAY " READ - Read from file selected"
           DISPLAY " LIST - List .dat files"
           DISPLAY " DELF - Delete the file you have selected "
           DISPLAY " EXIT - To Exit Program"
           DISPLAY " HELP - To get basic additional infos"
           ACCEPT ASW
       
           EVALUATE ASW
               WHEN 'WRIT'
                   PERFORM WRITE-FILE
               WHEN 'READ'
                   PERFORM READ-FILE
               WHEN 'LIST'
                   PERFORM LISTING
               WHEN 'DELF'
                    PERFORM DELOPERATION
               WHEN 'EXIT'
                   DISPLAY "Exiting program."
               WHEN 'CRED'
                    PERFORM CREATEDIT
               WHEN 'HELP'
                    PERFORM HELP
               WHEN OTHER
                   DISPLAY "Invalid option. Please try again."
                   PERFORM ASKUSER
           END-EVALUATE.
       


       DELOPERATION.
           DISPLAY "Destroying file.."
           CALL 'SYSTEM' USING DELCMD
           DISPLAY "File "NOWFILE" is successfully deleted !"
           PERFORM LISTING.


       HELP.
           DISPLAY " ".
           DISPLAY " ".
           DISPLAY " ".
           DISPLAY " This is the HELP Section"
           DISPLAY " ".
           DISPLAY "1. If you attempt to Modify or Read a file without".
           DISPLAY "creating or select one, the program will display an".
           DISPLAY "error and close".
           DISPLAY " ".
           DISPLAY "2. LIST command will display every file present in".
           DISPLAY "the directory, whatever its extention".
           DISPLAY " ".
           DISPLAY "3. Careful with the DELF command, it won't ask a ".
           DISPLAY "second time before deleting the selected file"
           PERFORM ASKUSER.
