       IDENTIFICATION DIVISION.
       PROGRAM-ID. INTERFACE-TUST.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 PSW PIC X(8) VALUE 'nootnoot'.
       77 ASW PIC X(8) VALUE 'nuutnuut'.
       77 ASW2 PIC X(4) VALUE 'NOOT'.
       77 NOTE PIC X(99) VALUE " ".
       77 INCI PIC ---B---B--9 VALUE '0'.
       PROCEDURE DIVISION.
           PERFORM HELLOMSG.
           PERFORM ASKPSW.
       
       ASKPSW.
           DISPLAY "Please enter Password:"
           ACCEPT ASW.
       
           IF ASW = PSW THEN
               DISPLAY " "
               DISPLAY "Welcome Home Officer"
               
               PERFORM SHOW
           ELSE
               DISPLAY "Incorrect password, please try again."
               DISPLAY " "
               PERFORM ASKPSW
           END-IF.
       
       SHOW.
           DISPLAY " "
           DISPLAY "**************************************************".
           DISPLAY "!            This is the TSAT registratio        !".
           DISPLAY "**************************************************".
           DISPLAY "Today's INCIDENT number is "INCI.
           DISPLAY "Today's SHORT NOTE :"NOTE.
           DISPLAY " "
           DISPLAY "To report INCIDENT type INCI".
           DISPLAY "To create a Public Note Type NOTE".
           DISPLAY "To lock again this terminal, type EXIT".
       ACCEPT ASW2.
           EVALUATE ASW2                                               
              WHEN "NOTE"
                 DISPLAY " "
                 DISPLAY "NOTE REGISTRATION"
                 PERFORM NOTEREGISTRATION

              WHEN "INCI"
                 DISPLAY " "
                 DISPLAY "NOTE REGISTRATION"
                 PERFORM INCIDENTREGISTRATION

              WHEN "EXIT"
                 DISPLAY " "
                 PERFORM HELLOMSG
                 DISPLAY " "
                 PERFORM ASKPSW

              WHEN OTHER
                 DISPLAY "Incorrect command used"
                 DISPLAY " "
                 PERFORM SHOW

           END-EVALUATE.


       NOTEREGISTRATION.
           DISPLAY "Enter your SHORT note".
           ACCEPT NOTE.
           PERFORM SHOW.
           
       INCIDENTREGISTRATION.
           DISPLAY "Set Today's INCIDENT number:".
           ACCEPT INCI.
           PERFORM SHOW.
           
       HELLOMSG.
           DISPLAY "**************************************************".
           DISPLAY "!                 Welcome to the TSAT            !".
           DISPLAY "!          TrainStar Station Access Terminal     !".
           DISPLAY "**************************************************".
           
       
       
